# SQL Assignment
## Elliot Landolt
### 4/15/24

#### Q1:
---

In [1]:
%load_ext sql
%sql sqlite:///goodz.db

In [7]:
%%sql
CREATE TABLE orders(
    order_ID INT PRIMARY KEY,
    item_name VARCHAR(20),
    price DOUBLE,
    customer_ID INT,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id));

CREATE TABLE customers(
    customer_ID INT PRIMARY KEY,
    signup_year INT,
    country VARCHAR(3),
    age INT);

 * sqlite:///digtech_database.db
Done.
Done.

[]

#### Q2:
---

Above is the code required to create two different tables within the same database. One table stores the orders, by ID, price, customer ID, and item name. The other table stores the customer data by customer ID, signup year, country, and age. The two primary keys are customer ID and Order ID, which are unique identifiers for each entry in the table. Since the customer ID exists in both tables, we can use it as a foreign key to bridge between the two tables.

#### Q3:
---

In [8]:
%%sql
INSERT INTO orders(order_ID, item_name, price, customer_ID)
VALUES
(100, "Blender", 45.66, 1001),
(101, "Blender", 43.23, 1098),
(102, "Treadmill", 765.76, 1009),
(103, "TV", 954.33, 1045),
(104, "TV", 476.60, 1009),
(105, "Lamp", 26.75, 1009),
(106, "Laptop", 1300.34, 1009),
(107, "TV", 675.55, 1009),
(108, "Treadmill", 886.87, 1009),
(109, "Treadmill", 1987.54, 1009);

 * sqlite:///digtech_database.db
10 rows affected.

[]

#### Q4:
---

In [9]:
%%sql
INSERT INTO customers(customer_ID, signup_year, country, age)
VALUES
(1000, 2004, "USA", 63),
(1001, 2008, "FR", 44),
(1002, 2010, "UK", 76),
(1003, 2018, "FR", 28),
(1004, 2001, "FR", 71),
(1005, 2015, "USA", 25),
(1006, 2017, "USA", 58),
(1007, 2009, "USA", 51),
(1008, 2020, "UK", 48),
(1009, 2017, "USA", 42);

 * sqlite:///digtech_database.db
10 rows affected.

[]

#### Q5:
---

In [10]:
%%sql
SELECT *
FROM orders;

 * sqlite:///digtech_database.db
Done.

[(100, 'Blender', 45.66, 1001),
 (101, 'Blender', 43.23, 1098),
 (102, 'Treadmill', 765.76, 1009),
 (103, 'TV', 954.33, 1045),
 (104, 'TV', 476.6, 1009),
 (105, 'Lamp', 26.75, 1009),
 (106, 'Laptop', 1300.34, 1009),
 (107, 'TV', 675.55, 1009),
 (108, 'Treadmill', 886.87, 1009),
 (109, 'Treadmill', 1987.54, 1009)]

#### Q6:
---

In [11]:
%%sql
SELECT *
FROM orders
LIMIT 4;

 * sqlite:///digtech_database.db
Done.

[(100, 'Blender', 45.66, 1001),
 (101, 'Blender', 43.23, 1098),
 (102, 'Treadmill', 765.76, 1009),
 (103, 'TV', 954.33, 1045)]

#### Q7:
---

In [20]:
%%sql
SELECT signup_year, country, age
FROM customers
WHERE country = "UK";

 * sqlite:///digtech_database.db
Done.

[(2010, 'UK', 76), (2020, 'UK', 48)]

#### Q8:
---

The mean age is 47.8 years old.

In [19]:
%%sql
SELECT AVG(age)
FROM customers
WHERE country = "USA";

 * sqlite:///digtech_database.db
Done.

[(47.8,)]

#### Q9:
---

3 treadmills have been sold.

In [22]:
%%sql
SELECT COUNT(*) AS treadmills_sold
FROM orders
WHERE item_name = "Treadmill";

 * sqlite:///digtech_database.db
Done.

[(3,)]

#### Q10:
---

In [25]:
%%sql
SELECT MIN(age)
FROM customers
WHERE country = "USA";

 * sqlite:///digtech_database.db
Done.

[(25,)]

#### Q11:
---

In [26]:
%%sql
SELECT country, AVG(age)
FROM customers
GROUP BY country;

 * sqlite:///digtech_database.db
Done.

[('FR', 47.666666666666664), ('UK', 62.0), ('USA', 47.8)]

#### Q12:
---

In [28]:
%%sql
SELECT item_name, AVG(price) AS avg_price
FROM orders
GROUP BY item_name
ORDER BY avg_price DESC;

 * sqlite:///digtech_database.db
Done.

[('Laptop', 1300.34),
 ('Treadmill', 1213.39),
 ('TV', 702.16),
 ('Blender', 44.44499999999999),
 ('Lamp', 26.75)]

#### Q13:
---

In [30]:
%%sql
SELECT item_name, AVG(price) AS avg_price
FROM orders
GROUP BY item_name
HAVING avg_price > 1000.00
ORDER BY avg_price DESC;

 * sqlite:///digtech_database.db
Done.

[('Laptop', 1300.34), ('Treadmill', 1213.39)]

#### 14:
---

In [31]:
%%sql
SELECT item_name, price
FROM orders
WHERE item_name LIKE 'T%' OR price < 100.00;

 * sqlite:///digtech_database.db
Done.

[('Blender', 45.66),
 ('Blender', 43.23),
 ('Treadmill', 765.76),
 ('TV', 954.33),
 ('TV', 476.6),
 ('Lamp', 26.75),
 ('TV', 675.55),
 ('Treadmill', 886.87),
 ('Treadmill', 1987.54)]

#### Q15:
---

The WHERE term is used to filter rows from the original dataset based on specified conditions before any grouping or aggregation occurs.
It is typically used with the SELECT, UPDATE, and DELETE statements. The HAVING clause is used to filter rows after grouping has occurred, typically when aggregate functions (e.g., SUM, AVG, COUNT) are used in the query. It is used in conjunction with the GROUP BY clause.